#pragma once
#include <list>

class SetOnList {
private:
    std::list<int> set;
public:
    SetOnList();
    SetOnList(int count, int min, int max);
    ~SetOnList();

    // Пустое множество?
    // Выходные параметры: логическое значение.
    bool is_empty_set();

    // Проверка принадлежности элемента множеству
    // Входные параметры: значение элемента. 
    // Выходные параметры: логическое значение. 
    bool contains_element(int value);

    // Добавление элемента в множество
    // Входные параметры: добавляемое в список значение. 
    void add_element(int value);

    // Мощность множества
    // Выходные параметры: целочисленное значение. 
    int get_size();

    // Вывод множества в строку
    // Входные параметры: символ разделителя. 
    // Выходные параметры: строка, содержащая элементы множества, разделенные символом разделителя. 
    std::string set_to_string(char separator);

    // Подмножество А-В
    // Входные параметры: указатель на множество В.
    // Выходные параметры: логическое значение True, если А является подмножеством В. 
    bool is_subset(SetOnList* B);

    // Равенство двух множеств А - В
    // Входные параметры: указатель на множество В.
    // Выходные параметры: логическое значение True, если А равно В.
    bool is_equal(SetOnList* B);

    // Объединение двух множеств
    // Входные параметры: два указателя на множества А и В.
    // Выходные параметры: множество-результат.
    static SetOnList* union_sets(SetOnList* A, SetOnList* B);

    // Пересечение двух множеств
    // Входные параметры: два указателя на множества А и В.
    // Выходные параметры: множество-результат. 
    static SetOnList* intersect_sets(SetOnList* A, SetOnList* B);

    // Разность множеств
    // Входные параметры: два указателя на множества А и В.
    // Выходные параметры: множество-результат.
    static SetOnList* difference_sets(SetOnList* A, SetOnList* B);

    // Симметричная разность
    // Входные параметры: два указателя на множества А и В.
    // Выходные параметры: множество-результат.
    static SetOnList* symmetric_difference_sets(SetOnList* A, SetOnList* B);
};