#pragma once

struct Node
{
    int data;
    Node* next;
};

// Создание пустого множества
// Выходные параметры: указатель на первый элемент списка, равный NULL.
Node* create_empty_set();

// Пустое множество?
// Входные параметры: указатель на первый элемент списка. 
// Выходные параметры: логическое значение.
bool is_empty_set(Node* start);

// Проверка принадлежности элемента множеству
// Входные параметры: указатель на первый элемент списка, значение элемента. 
// Выходные параметры: логическое значение. 
bool contains_element(Node* start, int value);

// Добавление элемента в множество
// Входные параметры: указатель на первый элемент списка, добавляемое в список значение. 
// Выходные параметры: указатель на первый элемент списка-результата. 
Node* add_element(Node* start, int value);

// Создание множества
// Входные параметры: количество элементов, интервал допустимых значений (от min до max). 
// Выходные параметры: указатель на первый элемент списка-результата. 
// Генерация значений – датчиком случайных чисел. 
Node* create_set(int count, int min, int max);

// Мощность множества
// Входные параметры: указатель на первый элемент списка. 
// Выходные параметры: целочисленное значение. 
int get_size(Node* start);

// Вывод множества в строку
// Входные параметры: указатель на первый элемент списка, символ разделителя. 
// Выходные параметры: строка, содержащая элементы множества, разделенные символом разделителя. 
std::string set_to_string(Node* start, char separator);

// Удаление множества
// Входные параметры: указатель на первый элемент списка. 
// Выходные параметры: указатель на первый элемент списка, равный NULL.
Node* delete_set(Node* start);

// Подмножество А-В
// Входные параметры: два указателя на первые элементы списков – исходных множеств А и В. 
// Выходные параметры: логическое значение True, если А является подмножеством В. 
bool is_subset(Node* A, Node* B);

// Равенство двух множеств А - В
// Входные параметры: два указателя на первые элементы списков – исходных множеств А и В.
// Выходные параметры: логическое значение True, если А равно В.
bool are_equal(Node* A, Node* B);

// Объединение двух множеств
// Входные параметры: два указателя на первые элементы списков – исходных множеств. 
// Выходные параметры: указатель на первый элемент списка-результата. 
Node* union_sets(Node* A, Node* B);

// Пересечение двух множеств
// Входные параметры: два указателя на первые элементы списков – исходных множеств. 
// Выходные параметры: указатель на первый элемент списка-результата. 
Node* intersect_sets(Node* A, Node* B);

// Разность множеств
// Входные параметры: два указателя на первые элементы списков – исходных множеств. 
// Выходные параметры: указатель на первый элемент списка-результата. 
Node* difference_sets(Node* A, Node* B);

// Симметричная разность
// Входные параметры: два указателя на первые элементы списков – исходных множеств. 
// Выходные параметры: указатель на первый элемент списка-результата. 
Node* symmetric_difference_sets(Node* A, Node* B);